Тестовая_база_ERP_14/src/Documents/АГ_КорректировкаЭкземпляраБюджета/АГ_КорректировкаЭкземпляраБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АГ_КорректировкаЭкземпляраБюджета</name>
  <comment>Документ предназначен для корректировки плановых показателей по бюджетам</comment>
  <basedOn>Document.ЭкземплярБюджета</basedOn>
  <registerRecords>AccumulationRegister.ОборотыБюджетов</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПланов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>CatalogRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГраницаФактДанных</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЭкземплярБюджета</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧДП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АГ_НаСогласованииДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеКорректировкиБюджета</name>
    <attributes>
      <name>СтатьяБюджетов</name>
      <type>
        <types>CatalogRef.СтатьиБюджетов</types>
        <types>CatalogRef.ПоказателиБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВВалюте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокЛимита</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПоПлану</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/AccumulationRegisters/ОборотыБюджетов/ОборотыБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборотыБюджетов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаСценария</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <dimensions>
    <name>ПериодПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПланов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяБюджетов</name>
    <type>
      <types>CatalogRef.СтатьиБюджетов</types>
      <types>CatalogRef.ПоказателиБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Корректировка</name>
    <type>
      <types>DocumentRef.АГ_КорректировкаЭкземпляраБюджета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тестовая_база_ERP_14/src/Enums/СтатусыПланов/СтатусыПланов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПланов</name>
  <comment>Статусы планов</comment>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>ВПодготовке</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Documents/АГ_КорректировкаЭкземпляраБюджета/ObjectModule.bsl
//<--АГ:[Казначейство][24.04.2019 18:05][Дядюра С.С.]

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если Не ДанныеЗаполнения.Проведен Тогда
		Возврат;
	КонецЕсли;
	Если ДанныеЗаполнения.Статус <> Перечисления.СтатусыПланов.Утвержден Тогда
		Возврат;
	КонецЕсли;
	Статус = Перечисления.СтатусыПланов.ВПодготовке;
	Организация = ДанныеЗаполнения.Организация;
	Подразделение = ДанныеЗаполнения.Подразделение;
	Сценарий = ДанныеЗаполнения.Сценарий;
	НачалоПериода = ДанныеЗаполнения.НачалоПериода;
	ОкончаниеПериода = ДанныеЗаполнения.ОкончаниеПериода;
	ВидБюджета = ДанныеЗаполнения.ВидБюджета; 
	Основание = ДанныеЗаполнения; 
	ГраницаФактДанных = ДанныеЗаполнения.ГраницаФактДанных;
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОборотыБюджетовОбороты.СтатьяБюджетов КАК СтатьяБюджетов,
	               |	ОборотыБюджетовОбороты.Валюта КАК Валюта,
	               |	ОборотыБюджетовОбороты.Аналитика1 КАК Аналитика1,
	               |	ОборотыБюджетовОбороты.Аналитика2 КАК Аналитика2,
	               |	ОборотыБюджетовОбороты.Аналитика3 КАК Аналитика3,
	               |	СУММА(ОборотыБюджетовОбороты.СуммаУпрОборот) КАК СуммаУпр,
	               |	СУММА(ОборотыБюджетовОбороты.СуммаВВалютеОборот) КАК СуммаВВалюте
	               |ИЗ
	               |	РегистрНакопления.ОборотыБюджетов.Обороты(, , Авто, ) КАК ОборотыБюджетовОбороты
	               |ГДЕ
	               |	ОборотыБюджетовОбороты.Регистратор = &Регистратор
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОборотыБюджетовОбороты.СтатьяБюджетов,
	               |	ОборотыБюджетовОбороты.Валюта,
	               |	ОборотыБюджетовОбороты.Аналитика1,
	               |	ОборотыБюджетовОбороты.Аналитика2,
	               |	ОборотыБюджетовОбороты.Аналитика3
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Аналитика1";
	
	Запрос.УстановитьПараметр("Регистратор", ДанныеЗаполнения);
	Рез = Запрос.Выполнить().Выгрузить();
	Рез.Колонки.Добавить("СуммаПоПлану",Неопределено);
	Рез.ЗаполнитьЗначения(0,"СуммаПоПлану");
	Для Каждого Стр Из Рез Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Аналитика1",Стр.Аналитика1);
		СтруктураПоиска.Вставить("Аналитика2",Стр.Аналитика2);
		СтруктураПоиска.Вставить("Аналитика3",Стр.Аналитика3);
		РезПоиска = Основание.АналитикаСтатейБюджетов.НайтиСтроки(СтруктураПоиска);
		Если РезПоиска.Количество() > 0 Тогда
			ИдентификаторСтроки = РезПоиска[0].ИдентификаторСтроки;
			Стр.СуммаПоПлану = Основание.ОборотыПоСтатьямБюджетов.Найти(ИдентификаторСтроки,"ИдентификаторСтроки").Сумма;
		КонецЕсли;
	КонецЦикла;
	ЧДП = Строка(Рез.Итог("СуммаУпр"));
	Рез.ЗаполнитьЗначения(0,"СуммаУпр");
	ДанныеКорректировкиБюджета.Загрузить(Рез);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					| ОборотыБюджетовОбороты.Корректировка КАК Корректировка
					| ИЗ
					| РегистрНакопления.ОборотыБюджетов.Обороты(, , Авто, ) КАК ОборотыБюджетовОбороты
					| ГДЕ
					| ОборотыБюджетовОбороты.Корректировка <> &ПустойДокумент
					| И ОборотыБюджетовОбороты.ПериодДень > &ПериодДокумента
					| И ОборотыБюджетовОбороты.Регистратор = &Регистратор

					| СГРУППИРОВАТЬ ПО
					| ОборотыБюджетовОбороты.Корректировка";
	Запрос.УстановитьПараметр("ПустойДокумент", Документы.АГ_КорректировкаЭкземпляраБюджета.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПериодДокумента", Дата);
	Запрос.УстановитьПараметр("Регистратор", Основание);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда
		Отказ = Истина;
		Текст = НСтр("ru = 'Нельзя проводить корректировку уже есть проведенные корректировке после текущей !'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,ЭтотОбъект,,,Отказ);		
	КонецЕсли;		
	
	
	НаборДвижений = РегистрыНакопления.ОборотыБюджетов.СоздатьНаборЗаписей();
	НаборДвижений.Отбор.Регистратор.Значение = Основание;
	НаборДвижений.Прочитать();
	Для Каждого Стр Из НаборДвижений Цикл
		Если Стр.Корректировка = Ссылка Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОборотыБюджетовОбороты.ПериодДень КАК Период,
	               |	ОборотыБюджетовОбороты.СуммаУпрОборот КАК СуммаУпр,
	               |	ОборотыБюджетовОбороты.СуммаВВалютеОборот КАК СуммаВВалюте
	               |ИЗ
	               |	РегистрНакопления.ОборотыБюджетов.Обороты(, , Авто, ) КАК ОборотыБюджетовОбороты
	               |ГДЕ
	               |	ОборотыБюджетовОбороты.Аналитика1 = &Аналитика1
	               |	И ОборотыБюджетовОбороты.ПериодПланирования МЕЖДУ &ДатаНП И &ДатаКП
	               |	И ОборотыБюджетовОбороты.Аналитика2 = &Аналитика2
	               |	И ОборотыБюджетовОбороты.Аналитика3 = &Аналитика3
	               |	И ОборотыБюджетовОбороты.Валюта = &Валюта
	               |	И ОборотыБюджетовОбороты.Подразделение = &Подразделение
	               |	И ОборотыБюджетовОбороты.Регистратор = &Регистратор
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";

	Для Каждого Стр Из ДанныеКорректировкиБюджета Цикл
		Если ?(Стр.СуммаУпр < 0,(Стр.ОстатокЛимита - (-Стр.СуммаУпр)),0) < 0  Тогда
			Отказ = Истина;
			ТекстСообщения = "ВНИМАНИЕ ПРОВЕДЕНИЕ ДОКУМЕНТА НЕ ВОЗМОЖНО!!! Сумма Корректировки превышает остаток лимита, исправьте сумму корректировки!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,,,Отказ);		
			Возврат;
		КонецЕсли;
		Если Статус <> Перечисления.СтатусыПланов.Утвержден Тогда
			Возврат;
		КонецЕсли;
		
		
		Запрос.УстановитьПараметр("ДатаНП", НачалоПериода);
		Запрос.УстановитьПараметр("ДатаКП", ОкончаниеПериода);
		Запрос.УстановитьПараметр("Валюта", Стр.Валюта);
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		Запрос.УстановитьПараметр("Аналитика1", Стр.Аналитика1);
		Запрос.УстановитьПараметр("Аналитика2", Стр.Аналитика2);
		Запрос.УстановитьПараметр("Аналитика3", Стр.Аналитика3);
		Запрос.УстановитьПараметр("Регистратор", Основание);
		
		Рез = Запрос.Выполнить().Выгрузить();
		Если Рез.Количество() > 0 Тогда
			Если Стр.СуммаУпр = Рез[0].СуммаУпр Тогда
				Продолжить;
			КонецЕсли;	
		КонецЕсли;
		Нстр = НаборДвижений.Добавить();
		Нстр.Регистратор = Основание;
		Нстр.Период = Дата;
		Нстр.Активность = Истина;
		Нстр.Подразделение = Подразделение;
		Нстр.Валюта = Стр.Валюта;
		Нстр.Аналитика1 = Стр.Аналитика1;
		Если ЗначениеЗаполнено(Стр.Аналитика2) Тогда
			Нстр.Аналитика2 = Стр.Аналитика2;
		Иначе
			Нстр.Аналитика2 = Неопределено;
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.Аналитика3) Тогда
			Нстр.Аналитика3 = Стр.Аналитика3;
		Иначе
			Нстр.Аналитика3 = Неопределено;
		КонецЕсли;		
		Нстр.Сценарий = Сценарий;
		Нстр.СтатьяБюджетов = Справочники.СтатьиБюджетов.НайтиПоНаименованию("План платежей");
		Нстр.ПериодПланирования = НачалоПериода;
		Нстр.Статус = Перечисления.СтатусыПланов.Утвержден;
		Нстр.СуммаУпр = Стр.СуммаУпр;
		Нстр.СуммаВВалюте = Стр.СуммаУпр;
		Нстр.СуммаСценария = Стр.СуммаУпр;
		Нстр.СуммаРегл = Стр.СуммаУпр;
		Нстр.Корректировка = Ссылка;
	КонецЦикла;
	НаборДвижений.Записать();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					| ОборотыБюджетовОбороты.Корректировка КАК Корректировка
					| ИЗ
					| РегистрНакопления.ОборотыБюджетов.Обороты(, , Авто, ) КАК ОборотыБюджетовОбороты
					| ГДЕ
					| ОборотыБюджетовОбороты.Корректировка <> &ПустойДокумент
					| И ОборотыБюджетовОбороты.ПериодДень > &ПериодДокумента
					| И ОборотыБюджетовОбороты.Регистратор = &Регистратор

					| СГРУППИРОВАТЬ ПО
					| ОборотыБюджетовОбороты.Корректировка";
	Запрос.УстановитьПараметр("ПустойДокумент", Документы.АГ_КорректировкаЭкземпляраБюджета.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПериодДокумента", Дата);
	Запрос.УстановитьПараметр("Регистратор", Основание);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда
		Отказ = Истина;
		Текст = НСтр("ru = 'Нельзя отменять проведение корректировки есть проведенные корректировки после текущей!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,ЭтотОбъект,,,Отказ);		
		Возврат;
	КонецЕсли;	
	
	
	
	НаборДвижений = РегистрыНакопления.ОборотыБюджетов.СоздатьНаборЗаписей();
	НаборДвижений.Отбор.Регистратор.Значение = Основание;
	НаборДвижений.Прочитать();	
	Инд = 0;
	Пока Инд <> НаборДвижений.Количество() Цикл
		Если НаборДвижений[Инд].Корректировка = Ссылка Тогда
			НаборДвижений.Удалить(НаборДвижений[Инд]);
			Инд = Инд-1;
		КонецЕсли;
		Инд = Инд+1;
	КонецЦикла;
	НаборДвижений.Записать();
КонецПроцедуры

//<--АГ:[Казначейство][24.04.2019 18:05][Дядюра С.С.]
